{"format": "layers-model", "generatedBy": "keras v2.12.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "modelTopology": {"keras_version": "2.12.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model", "trainable": false, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [1, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d", "trainable": false, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d", "trainable": false, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d", "inbound_nodes": [[["zero_padding2d", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply", "trainable": false, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply", "inbound_nodes": [["_CONSTANT_VALUE", -1, 0.1666666716337204, {"y": ["conv2d", 0, 0], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add", "trainable": false, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add", "inbound_nodes": [["tf.math.multiply", 0, 0, {"y": 0.5, "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.clip_by_value", "trainable": false, "dtype": "float32", "function": "clip_by_value"}, "name": "tf.clip_by_value", "inbound_nodes": [["tf.__operators__.add", 0, 0, {"clip_value_min": 0, "clip_value_max": 1}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_1", "trainable": false, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_1", "inbound_nodes": [["conv2d", 0, 0, {"y": ["tf.clip_by_value", 0, 0], "name": null}]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d", "trainable": false, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "depthwise_conv2d", "inbound_nodes": [[["tf.math.multiply_1", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.nn.relu", "trainable": false, "dtype": "float32", "function": "nn.relu"}, "name": "tf.nn.relu", "inbound_nodes": [["depthwise_conv2d", 0, 0, {"name": null}]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": false, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1", "inbound_nodes": [[["tf.nn.relu", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_1", "trainable": false, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_1", "inbound_nodes": [["conv2d_1", 0, 0, {"y": ["tf.math.multiply_1", 0, 0], "name": null}]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": false, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_2", "inbound_nodes": [[["tf.__operators__.add_1", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.nn.relu_1", "trainable": false, "dtype": "float32", "function": "nn.relu"}, "name": "tf.nn.relu_1", "inbound_nodes": [["conv2d_2", 0, 0, {"name": null}]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_1", "trainable": false, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_1", "inbound_nodes": [[["tf.nn.relu_1", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_1", "trainable": false, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "depthwise_conv2d_1", "inbound_nodes": [[["zero_padding2d_1", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.nn.relu_2", "trainable": false, "dtype": "float32", "function": "nn.relu"}, "name": "tf.nn.relu_2", "inbound_nodes": [["depthwise_conv2d_1", 0, 0, {"name": null}]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_3", "trainable": false, "dtype": "float32", "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_3", "inbound_nodes": [[["tf.nn.relu_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_4", "trainable": false, "dtype": "float32", "filters": 72, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_4", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.nn.relu_3", "trainable": false, "dtype": "float32", "function": "nn.relu"}, "name": "tf.nn.relu_3", "inbound_nodes": [["conv2d_4", 0, 0, {"name": null}]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_2", "trainable": false, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "depthwise_conv2d_2", "inbound_nodes": [[["tf.nn.relu_3", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.nn.relu_4", "trainable": false, "dtype": "float32", "function": "nn.relu"}, "name": "tf.nn.relu_4", "inbound_nodes": [["depthwise_conv2d_2", 0, 0, {"name": null}]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_5", "trainable": false, "dtype": "float32", "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_5", "inbound_nodes": [[["tf.nn.relu_4", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_2", "trainable": false, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_2", "inbound_nodes": [["conv2d_5", 0, 0, {"y": ["conv2d_3", 0, 0], "name": null}]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_6", "trainable": false, "dtype": "float32", "filters": 72, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_6", "inbound_nodes": [[["tf.__operators__.add_2", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.nn.relu_5", "trainable": false, "dtype": "float32", "function": "nn.relu"}, "name": "tf.nn.relu_5", "inbound_nodes": [["conv2d_6", 0, 0, {"name": null}]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_2", "trainable": false, "dtype": "float32", "padding": [[2, 2], [2, 2]], "data_format": "channels_last"}, "name": "zero_padding2d_2", "inbound_nodes": [[["tf.nn.relu_5", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_3", "trainable": false, "dtype": "float32", "kernel_size": [5, 5], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "depthwise_conv2d_3", "inbound_nodes": [[["zero_padding2d_2", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.nn.relu_6", "trainable": false, "dtype": "float32", "function": "nn.relu"}, "name": "tf.nn.relu_6", "inbound_nodes": [["depthwise_conv2d_3", 0, 0, {"name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.reduce_mean", "trainable": false, "dtype": "float32", "function": "math.reduce_mean"}, "name": "tf.math.reduce_mean", "inbound_nodes": [["tf.nn.relu_6", 0, 0, {"axis": [1, 2], "keepdims": true}]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_7", "trainable": false, "dtype": "float32", "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_7", "inbound_nodes": [[["tf.math.reduce_mean", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.nn.relu_7", "trainable": false, "dtype": "float32", "function": "nn.relu"}, "name": "tf.nn.relu_7", "inbound_nodes": [["conv2d_7", 0, 0, {"name": null}]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_8", "trainable": false, "dtype": "float32", "filters": 72, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_8", "inbound_nodes": [[["tf.nn.relu_7", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_2", "trainable": false, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_2", "inbound_nodes": [["_CONSTANT_VALUE", -1, 0.1666666716337204, {"y": ["conv2d_8", 0, 0], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_3", "trainable": false, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_3", "inbound_nodes": [["tf.math.multiply_2", 0, 0, {"y": 0.5, "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.clip_by_value_1", "trainable": false, "dtype": "float32", "function": "clip_by_value"}, "name": "tf.clip_by_value_1", "inbound_nodes": [["tf.__operators__.add_3", 0, 0, {"clip_value_min": 0, "clip_value_max": 1}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_3", "trainable": false, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_3", "inbound_nodes": [["tf.clip_by_value_1", 0, 0, {"y": ["tf.nn.relu_6", 0, 0], "name": null}]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_9", "trainable": false, "dtype": "float32", "filters": 40, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_9", "inbound_nodes": [[["tf.math.multiply_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_10", "trainable": false, "dtype": "float32", "filters": 120, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_10", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.nn.relu_8", "trainable": false, "dtype": "float32", "function": "nn.relu"}, "name": "tf.nn.relu_8", "inbound_nodes": [["conv2d_10", 0, 0, {"name": null}]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_3", "trainable": false, "dtype": "float32", "padding": [[2, 2], [2, 2]], "data_format": "channels_last"}, "name": "zero_padding2d_3", "inbound_nodes": [[["tf.nn.relu_8", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_4", "trainable": false, "dtype": "float32", "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "depthwise_conv2d_4", "inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.nn.relu_9", "trainable": false, "dtype": "float32", "function": "nn.relu"}, "name": "tf.nn.relu_9", "inbound_nodes": [["depthwise_conv2d_4", 0, 0, {"name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.reduce_mean_1", "trainable": false, "dtype": "float32", "function": "math.reduce_mean"}, "name": "tf.math.reduce_mean_1", "inbound_nodes": [["tf.nn.relu_9", 0, 0, {"axis": [1, 2], "keepdims": true}]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_11", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_11", "inbound_nodes": [[["tf.math.reduce_mean_1", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.nn.relu_10", "trainable": false, "dtype": "float32", "function": "nn.relu"}, "name": "tf.nn.relu_10", "inbound_nodes": [["conv2d_11", 0, 0, {"name": null}]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_12", "trainable": false, "dtype": "float32", "filters": 120, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_12", "inbound_nodes": [[["tf.nn.relu_10", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_4", "trainable": false, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_4", "inbound_nodes": [["_CONSTANT_VALUE", -1, 0.1666666716337204, {"y": ["conv2d_12", 0, 0], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_4", "trainable": false, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_4", "inbound_nodes": [["tf.math.multiply_4", 0, 0, {"y": 0.5, "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.clip_by_value_2", "trainable": false, "dtype": "float32", "function": "clip_by_value"}, "name": "tf.clip_by_value_2", "inbound_nodes": [["tf.__operators__.add_4", 0, 0, {"clip_value_min": 0, "clip_value_max": 1}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_5", "trainable": false, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_5", "inbound_nodes": [["tf.clip_by_value_2", 0, 0, {"y": ["tf.nn.relu_9", 0, 0], "name": null}]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_13", "trainable": false, "dtype": "float32", "filters": 40, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_13", "inbound_nodes": [[["tf.math.multiply_5", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_5", "trainable": false, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_5", "inbound_nodes": [["conv2d_13", 0, 0, {"y": ["conv2d_9", 0, 0], "name": null}]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_14", "trainable": false, "dtype": "float32", "filters": 120, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_14", "inbound_nodes": [[["tf.__operators__.add_5", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.nn.relu_11", "trainable": false, "dtype": "float32", "function": "nn.relu"}, "name": "tf.nn.relu_11", "inbound_nodes": [["conv2d_14", 0, 0, {"name": null}]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_4", "trainable": false, "dtype": "float32", "padding": [[2, 2], [2, 2]], "data_format": "channels_last"}, "name": "zero_padding2d_4", "inbound_nodes": [[["tf.nn.relu_11", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_5", "trainable": false, "dtype": "float32", "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "depthwise_conv2d_5", "inbound_nodes": [[["zero_padding2d_4", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.nn.relu_12", "trainable": false, "dtype": "float32", "function": "nn.relu"}, "name": "tf.nn.relu_12", "inbound_nodes": [["depthwise_conv2d_5", 0, 0, {"name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.reduce_mean_2", "trainable": false, "dtype": "float32", "function": "math.reduce_mean"}, "name": "tf.math.reduce_mean_2", "inbound_nodes": [["tf.nn.relu_12", 0, 0, {"axis": [1, 2], "keepdims": true}]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_15", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_15", "inbound_nodes": [[["tf.math.reduce_mean_2", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.nn.relu_13", "trainable": false, "dtype": "float32", "function": "nn.relu"}, "name": "tf.nn.relu_13", "inbound_nodes": [["conv2d_15", 0, 0, {"name": null}]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_16", "trainable": false, "dtype": "float32", "filters": 120, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_16", "inbound_nodes": [[["tf.nn.relu_13", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_6", "trainable": false, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_6", "inbound_nodes": [["_CONSTANT_VALUE", -1, 0.1666666716337204, {"y": ["conv2d_16", 0, 0], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_6", "trainable": false, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_6", "inbound_nodes": [["tf.math.multiply_6", 0, 0, {"y": 0.5, "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.clip_by_value_3", "trainable": false, "dtype": "float32", "function": "clip_by_value"}, "name": "tf.clip_by_value_3", "inbound_nodes": [["tf.__operators__.add_6", 0, 0, {"clip_value_min": 0, "clip_value_max": 1}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_7", "trainable": false, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_7", "inbound_nodes": [["tf.clip_by_value_3", 0, 0, {"y": ["tf.nn.relu_12", 0, 0], "name": null}]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_17", "trainable": false, "dtype": "float32", "filters": 40, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_17", "inbound_nodes": [[["tf.math.multiply_7", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_7", "trainable": false, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_7", "inbound_nodes": [["conv2d_17", 0, 0, {"y": ["tf.__operators__.add_5", 0, 0], "name": null}]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_18", "trainable": false, "dtype": "float32", "filters": 240, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_18", "inbound_nodes": [[["tf.__operators__.add_7", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_8", "trainable": false, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_8", "inbound_nodes": [["_CONSTANT_VALUE", -1, 0.1666666716337204, {"y": ["conv2d_18", 0, 0], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_8", "trainable": false, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_8", "inbound_nodes": [["tf.math.multiply_8", 0, 0, {"y": 0.5, "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.clip_by_value_4", "trainable": false, "dtype": "float32", "function": "clip_by_value"}, "name": "tf.clip_by_value_4", "inbound_nodes": [["tf.__operators__.add_8", 0, 0, {"clip_value_min": 0, "clip_value_max": 1}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_9", "trainable": false, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_9", "inbound_nodes": [["conv2d_18", 0, 0, {"y": ["tf.clip_by_value_4", 0, 0], "name": null}]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_5", "trainable": false, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_5", "inbound_nodes": [[["tf.math.multiply_9", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_6", "trainable": false, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "depthwise_conv2d_6", "inbound_nodes": [[["zero_padding2d_5", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_10", "trainable": false, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_10", "inbound_nodes": [["_CONSTANT_VALUE", -1, 0.1666666716337204, {"y": ["depthwise_conv2d_6", 0, 0], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_9", "trainable": false, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_9", "inbound_nodes": [["tf.math.multiply_10", 0, 0, {"y": 0.5, "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.clip_by_value_5", "trainable": false, "dtype": "float32", "function": "clip_by_value"}, "name": "tf.clip_by_value_5", "inbound_nodes": [["tf.__operators__.add_9", 0, 0, {"clip_value_min": 0, "clip_value_max": 1}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_11", "trainable": false, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_11", "inbound_nodes": [["depthwise_conv2d_6", 0, 0, {"y": ["tf.clip_by_value_5", 0, 0], "name": null}]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_19", "trainable": false, "dtype": "float32", "filters": 80, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_19", "inbound_nodes": [[["tf.math.multiply_11", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_20", "trainable": false, "dtype": "float32", "filters": 200, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_20", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_12", "trainable": false, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_12", "inbound_nodes": [["_CONSTANT_VALUE", -1, 0.1666666716337204, {"y": ["conv2d_20", 0, 0], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_10", "trainable": false, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_10", "inbound_nodes": [["tf.math.multiply_12", 0, 0, {"y": 0.5, "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.clip_by_value_6", "trainable": false, "dtype": "float32", "function": "clip_by_value"}, "name": "tf.clip_by_value_6", "inbound_nodes": [["tf.__operators__.add_10", 0, 0, {"clip_value_min": 0, "clip_value_max": 1}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_13", "trainable": false, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_13", "inbound_nodes": [["conv2d_20", 0, 0, {"y": ["tf.clip_by_value_6", 0, 0], "name": null}]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_7", "trainable": false, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "depthwise_conv2d_7", "inbound_nodes": [[["tf.math.multiply_13", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_14", "trainable": false, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_14", "inbound_nodes": [["_CONSTANT_VALUE", -1, 0.1666666716337204, {"y": ["depthwise_conv2d_7", 0, 0], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_11", "trainable": false, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_11", "inbound_nodes": [["tf.math.multiply_14", 0, 0, {"y": 0.5, "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.clip_by_value_7", "trainable": false, "dtype": "float32", "function": "clip_by_value"}, "name": "tf.clip_by_value_7", "inbound_nodes": [["tf.__operators__.add_11", 0, 0, {"clip_value_min": 0, "clip_value_max": 1}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_15", "trainable": false, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_15", "inbound_nodes": [["depthwise_conv2d_7", 0, 0, {"y": ["tf.clip_by_value_7", 0, 0], "name": null}]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_21", "trainable": false, "dtype": "float32", "filters": 80, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_21", "inbound_nodes": [[["tf.math.multiply_15", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_12", "trainable": false, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_12", "inbound_nodes": [["conv2d_21", 0, 0, {"y": ["conv2d_19", 0, 0], "name": null}]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_22", "trainable": false, "dtype": "float32", "filters": 184, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_22", "inbound_nodes": [[["tf.__operators__.add_12", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_16", "trainable": false, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_16", "inbound_nodes": [["_CONSTANT_VALUE", -1, 0.1666666716337204, {"y": ["conv2d_22", 0, 0], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_13", "trainable": false, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_13", "inbound_nodes": [["tf.math.multiply_16", 0, 0, {"y": 0.5, "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.clip_by_value_8", "trainable": false, "dtype": "float32", "function": "clip_by_value"}, "name": "tf.clip_by_value_8", "inbound_nodes": [["tf.__operators__.add_13", 0, 0, {"clip_value_min": 0, "clip_value_max": 1}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_17", "trainable": false, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_17", "inbound_nodes": [["conv2d_22", 0, 0, {"y": ["tf.clip_by_value_8", 0, 0], "name": null}]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_8", "trainable": false, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "depthwise_conv2d_8", "inbound_nodes": [[["tf.math.multiply_17", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_18", "trainable": false, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_18", "inbound_nodes": [["_CONSTANT_VALUE", -1, 0.1666666716337204, {"y": ["depthwise_conv2d_8", 0, 0], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_14", "trainable": false, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_14", "inbound_nodes": [["tf.math.multiply_18", 0, 0, {"y": 0.5, "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.clip_by_value_9", "trainable": false, "dtype": "float32", "function": "clip_by_value"}, "name": "tf.clip_by_value_9", "inbound_nodes": [["tf.__operators__.add_14", 0, 0, {"clip_value_min": 0, "clip_value_max": 1}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_19", "trainable": false, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_19", "inbound_nodes": [["depthwise_conv2d_8", 0, 0, {"y": ["tf.clip_by_value_9", 0, 0], "name": null}]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_23", "trainable": false, "dtype": "float32", "filters": 80, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_23", "inbound_nodes": [[["tf.math.multiply_19", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_15", "trainable": false, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_15", "inbound_nodes": [["conv2d_23", 0, 0, {"y": ["tf.__operators__.add_12", 0, 0], "name": null}]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_24", "trainable": false, "dtype": "float32", "filters": 184, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_24", "inbound_nodes": [[["tf.__operators__.add_15", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_20", "trainable": false, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_20", "inbound_nodes": [["_CONSTANT_VALUE", -1, 0.1666666716337204, {"y": ["conv2d_24", 0, 0], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_16", "trainable": false, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_16", "inbound_nodes": [["tf.math.multiply_20", 0, 0, {"y": 0.5, "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.clip_by_value_10", "trainable": false, "dtype": "float32", "function": "clip_by_value"}, "name": "tf.clip_by_value_10", "inbound_nodes": [["tf.__operators__.add_16", 0, 0, {"clip_value_min": 0, "clip_value_max": 1}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_21", "trainable": false, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_21", "inbound_nodes": [["conv2d_24", 0, 0, {"y": ["tf.clip_by_value_10", 0, 0], "name": null}]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_9", "trainable": false, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "depthwise_conv2d_9", "inbound_nodes": [[["tf.math.multiply_21", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_22", "trainable": false, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_22", "inbound_nodes": [["_CONSTANT_VALUE", -1, 0.1666666716337204, {"y": ["depthwise_conv2d_9", 0, 0], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_17", "trainable": false, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_17", "inbound_nodes": [["tf.math.multiply_22", 0, 0, {"y": 0.5, "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.clip_by_value_11", "trainable": false, "dtype": "float32", "function": "clip_by_value"}, "name": "tf.clip_by_value_11", "inbound_nodes": [["tf.__operators__.add_17", 0, 0, {"clip_value_min": 0, "clip_value_max": 1}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_23", "trainable": false, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_23", "inbound_nodes": [["depthwise_conv2d_9", 0, 0, {"y": ["tf.clip_by_value_11", 0, 0], "name": null}]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_25", "trainable": false, "dtype": "float32", "filters": 80, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_25", "inbound_nodes": [[["tf.math.multiply_23", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_18", "trainable": false, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_18", "inbound_nodes": [["conv2d_25", 0, 0, {"y": ["tf.__operators__.add_15", 0, 0], "name": null}]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_26", "trainable": false, "dtype": "float32", "filters": 480, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_26", "inbound_nodes": [[["tf.__operators__.add_18", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_24", "trainable": false, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_24", "inbound_nodes": [["_CONSTANT_VALUE", -1, 0.1666666716337204, {"y": ["conv2d_26", 0, 0], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_19", "trainable": false, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_19", "inbound_nodes": [["tf.math.multiply_24", 0, 0, {"y": 0.5, "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.clip_by_value_12", "trainable": false, "dtype": "float32", "function": "clip_by_value"}, "name": "tf.clip_by_value_12", "inbound_nodes": [["tf.__operators__.add_19", 0, 0, {"clip_value_min": 0, "clip_value_max": 1}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_25", "trainable": false, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_25", "inbound_nodes": [["conv2d_26", 0, 0, {"y": ["tf.clip_by_value_12", 0, 0], "name": null}]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "depthwise_conv2d_10", "trainable": false, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "depthwise_conv2d_10", "inbound_nodes": [[["tf.math.multiply_25", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_26", "trainable": false, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_26", "inbound_nodes": [["_CONSTANT_VALUE", -1, 0.1666666716337204, {"y": ["depthwise_conv2d_10", 0, 0], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_20", "trainable": false, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_20", "inbound_nodes": [["tf.math.multiply_26", 0, 0, {"y": 0.5, "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.clip_by_value_13", "trainable": false, "dtype": "float32", "function": "clip_by_value"}, "name": "tf.clip_by_value_13", "inbound_nodes": [["tf.__operators__.add_20", 0, 0, {"clip_value_min": 0, "clip_value_max": 1}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_27", "trainable": false, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_27", "inbound_nodes": [["depthwise_conv2d_10", 0, 0, {"y": ["tf.clip_by_value_13", 0, 0], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.reduce_mean_3", "trainable": false, "dtype": "float32", "function": "math.reduce_mean"}, "name": "tf.math.reduce_mean_3", "inbound_nodes": [["tf.math.multiply_27", 0, 0, {"axis": [1, 2], "keepdims": true}]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_27", "trainable": false, "dtype": "float32", "filters": 120, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_27", "inbound_nodes": [[["tf.math.reduce_mean_3", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.nn.relu_14", "trainable": false, "dtype": "float32", "function": "nn.relu"}, "name": "tf.nn.relu_14", "inbound_nodes": [["conv2d_27", 0, 0, {"name": null}]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_28", "trainable": false, "dtype": "float32", "filters": 480, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_28", "inbound_nodes": [[["tf.nn.relu_14", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_28", "trainable": false, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_28", "inbound_nodes": [["_CONSTANT_VALUE", -1, 0.1666666716337204, {"y": ["conv2d_28", 0, 0], "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_21", "trainable": false, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_21", "inbound_nodes": [["tf.math.multiply_28", 0, 0, {"y": 0.5, "name": null}]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.clip_by_value_14", "trainable": false, "dtype": "float32", "function": "clip_by_value"}, "name": "tf.clip_by_value_14", "inbound_nodes": [["tf.__operators__.add_21", 0, 0, {"clip_value_min": 0, 